# vscode extensions
# to install: cat extensions.txt | grep -v '^#' | grep -v '^$' | xargs -L 1 code --install-extension

# themes
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons

# code formatting
esbenp.prettier-vscode
dbaeumer.vscode-eslint

# git
eamodio.gitlens

# ai tools
anthropic.claude-code

# python
ms-python.python
ms-python.vscode-pylance
ms-python.black-formatter

# docker & containers
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker

# utilities
asciidoctor.asciidoctor-vscode
davidanson.vscode-markdownlint
jock.svg
ms-vscode-remote.remote-wsl
yzhang.markdown-all-in-one
