# VSCode Extensions
# To install: cat extensions.txt | grep -v '^#' | grep -v '^$' | xargs -L 1 code --install-extension

# Themes
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
maximetinu.identical-sublime-monokai-csharp-theme-colorizer
adamcaviness.theme-monokai-dark-soda
akamud.vscode-theme-onedark
azemoh.one-monokai
azemoh.theme-onedark
ivankinder.one-monokai-darker-spectrum
robbowen.synthwave-vscode
seansassenrath.vscode-theme-superonedark
zhuangtongfa.material-theme

# AI Tools
anthropic.claude-code
github.copilot
github.copilot-chat

# Git
eamodio.gitlens

# Code Formatting & Linting
dbaeumer.vscode-eslint
esbenp.prettier-vscode
davidanson.vscode-markdownlint

# Languages
angular.ng-template
bradlc.vscode-tailwindcss
twxs.cmake
mquandalle.graphql

# Python
ms-python.python
ms-python.vscode-pylance
ms-python.black-formatter
ms-python.debugpy
ms-python.vscode-python-envs

# Jupyter
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# C/C++
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools

# .NET / C#
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.dotnet-interactive-vscode
ms-dotnettools.vscode-dotnet-runtime
icsharpcode.ilspy-vscode
tintoy.msbuild-project-tools

# Containers
ms-azuretools.vscode-containers

# Vue
vue.volar

# Utilities
humao.rest-client
qwtel.sqlite-viewer
asciidoctor.asciidoctor-vscode
austenc.tailwind-docs
ciantic.keymapceditor-vsc
davidanson.vscode-markdownlint
firefox-devtools.vscode-firefox-debug
formulahendry.code-runner
jock.svg
ms-vscode-remote.remote-wsl
ms-vscode.live-server
nrwl.angular-console
yzhang.markdown-all-in-one
